In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})

In [2]:
df

  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
1    a  two  1.247803 -1.200718
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167
4    a  one  0.621728 -1.010352

In [3]:
grouped = df['data1'].groupby(df['key1'])

In [4]:
grouped

In [5]:
grouped.describe()

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,-0.03388,1.706697,-1.971171,-0.674722,0.621728,0.934765,1.247803
b,2.0,-0.20873,0.025827,-0.226992,-0.217861,-0.208730,-0.199599,-0.190468

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [7]:
means

key1  key2
a     one    -0.674722
      two     1.247803
b     one    -0.190468
      two    -0.226992
Name: data1, dtype: float64

In [8]:
means.unstack()

key2       one       two
key1
a    -0.674722  1.247803
b    -0.190468 -0.226992

In [9]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [10]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [11]:
df

  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
1    a  two  1.247803 -1.200718
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167
4    a  one  0.621728 -1.010352

In [12]:
df['data1'].groupby([states,years]).mean()

California  2005    1.247803
            2006   -0.190468
Ohio        2005   -1.099082
            2006    0.621728
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

        data1     data2
key1
a    -0.03388 -0.764075
b    -0.20873  0.443224

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.674722 -0.545753
     two   1.247803 -1.200718
b    one  -0.190468 -0.142719
     two  -0.226992  1.029167

In [15]:
df

  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
1    a  two  1.247803 -1.200718
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167
4    a  one  0.621728 -1.010352

In [16]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [17]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print('\n')

a
  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
1    a  two  1.247803 -1.200718
4    a  one  0.621728 -1.010352


b
  key1 key2     data1     data2
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167

In [18]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print('\n')

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
4    a  one  0.621728 -1.010352


('a', 'two')
  key1 key2     data1     data2
1    a  two  1.247803 -1.200718


('b', 'one')
  key1 key2     data1     data2
2    b  one -0.190468 -0.142719


('b', 'two')
  key1 key2     data1     data2
3    b  two -0.226992  1.029167

In [19]:
pieces = dict(list(df.groupby('key1')))

In [20]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167

In [21]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [22]:
grouped = df.groupby(df.dtypes, axis=1)

In [23]:
for dtype, group in grouped:
    print(dtype)
    print(group)
    print('\n')

float64
      data1     data2
0 -1.971171 -0.081154
1  1.247803 -1.200718
2 -0.190468 -0.142719
3 -0.226992  1.029167
4  0.621728 -1.010352


object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [24]:
df.groupby('key1')['data1']

In [25]:
df.groupby('key1')[['data2']]

In [26]:
df[['data2']].groupby(df['key1']).mean()

         data2
key1
a    -0.764075
b     0.443224

In [27]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.545753
     two  -1.200718
b    one  -0.142719
     two   1.029167

In [28]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [29]:
s_grouped

In [30]:
s_grouped.mean()

key1  key2
a     one    -0.545753
      two    -1.200718
b     one    -0.142719
      two     1.029167
Name: data2, dtype: float64

In [31]:
people = pd.DataFrame(np.random.randn(5, 5), 
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [32]:
people

               a         b         c         d         e
Joe     1.411505 -0.190359  1.407626  1.720712 -0.953756
Steve  -0.945579  0.098859  0.372316 -0.888320  1.033196
Wes     1.048901 -0.223159 -0.541823 -0.307072 -0.567449
Jim     0.277395 -2.182021  0.144220  1.537440 -0.489114
Travis -0.196050  0.043975 -0.299694  0.142481 -0.140592

In [33]:
people.iloc[2:3, [1, 2]] = np.nan

In [34]:
people

               a         b         c         d         e
Joe     1.411505 -0.190359  1.407626  1.720712 -0.953756
Steve  -0.945579  0.098859  0.372316 -0.888320  1.033196
Wes     1.048901       NaN       NaN -0.307072 -0.567449
Jim     0.277395 -2.182021  0.144220  1.537440 -0.489114
Travis -0.196050  0.043975 -0.299694  0.142481 -0.140592

In [35]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [36]:
by_column = people.groupby(mapping, axis=1)

In [37]:
by_column.sum()

            blue       red
Joe     3.128338  0.267390
Steve  -0.516004  0.186476
Wes    -0.307072  0.481453
Jim     1.681660 -2.393740
Travis -0.157213 -0.292667

In [38]:
map_series = pd.Series(mapping)

In [39]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3  2.737801 -2.372379  1.551846  2.951080 -2.010319
5 -0.945579  0.098859  0.372316 -0.888320  1.033196
6 -0.196050  0.043975 -0.299694  0.142481 -0.140592

In [42]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [43]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  1.048901 -0.190359  1.407626 -0.307072 -0.953756
  two  0.277395 -2.182021  0.144220  1.537440 -0.489114
5 one -0.945579  0.098859  0.372316 -0.888320  1.033196
6 two -0.196050  0.043975 -0.299694  0.142481 -0.140592

In [44]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1, 3, 5, 1, 3]],
names=['cty', 'tenor'])

In [45]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [46]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [47]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.067980 -1.558550 -0.473135 -1.145432  0.014270
1     -1.037833 -0.192589  0.253270 -0.041193 -0.248629
2     -0.070513  1.054075 -0.216537 -1.278332  0.929955
3     -0.007836 -0.822943  0.606376  0.433496  1.438276

In [48]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [49]:
df

  key1 key2     data1     data2
0    a  one -1.971171 -0.081154
1    a  two  1.247803 -1.200718
2    b  one -0.190468 -0.142719
3    b  two -0.226992  1.029167
4    a  one  0.621728 -1.010352

In [50]:
grouped = df.groupby('key1')

In [51]:
grouped['data1'].quantile(0.9)

key1
a    1.122588
b   -0.194120
Name: data1, dtype: float64

In [52]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [53]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.218975  1.119564
b     0.036524  1.171885

In [54]:
grouped.describe()

     data1                                                             \
     count     mean       std       min       25%       50%       75%
key1
a      3.0 -0.03388  1.706697 -1.971171 -0.674722  0.621728  0.934765
b      2.0 -0.20873  0.025827 -0.226992 -0.217861 -0.208730 -0.199599

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.247803   3.0 -0.764075  0.599037 -1.200718 -1.105535 -1.010352
b    -0.190468   2.0  0.443224  0.828648 -0.142719  0.150253  0.443224


           75%       max
key1
a    -0.545753 -0.081154
b     0.736195  1.029167

In [55]:
frame = pd.DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})

In [56]:
frame.head()

      data1     data2
0  1.336106  0.545129
1  0.646471 -0.084332
2  0.808621 -1.521302
3  0.424847 -1.160979
4  0.152273  0.573010

In [57]:
quartiles = pd.cut(frame.data1, 4)

In [58]:
quartiles[:10]

0     (1.042, 2.508]
1    (-0.423, 1.042]
2    (-0.423, 1.042]
3    (-0.423, 1.042]
4    (-0.423, 1.042]
5    (-0.423, 1.042]
6    (-0.423, 1.042]
7    (-3.36, -1.889]
8    (-0.423, 1.042]
9     (1.042, 2.508]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.36, -1.889] < (-1.889, -0.423] < (-0.423, 1.042] < (1.042, 2.508]]

In [59]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [60]:
grouped = frame.data2.groupby(quartiles)

In [61]:
grouped

In [62]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.36, -1.889]  -1.659820  2.294553   34.0  0.011203
(-1.889, -0.423] -2.715148  2.522339  303.0  0.035629
(-0.423, 1.042]  -2.619906  2.794801  518.0 -0.059427
(1.042, 2.508]   -3.040726  2.790110  145.0 -0.053887

In [63]:
grouping = pd.qcut(frame.data1, 5, labels=False)

In [64]:
grouped = frame.data2.groupby(grouping)

In [65]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.508638  2.522339  200.0  0.017284
1     -2.715148  2.774913  200.0  0.002179
2     -2.379148  2.794801  200.0 -0.009701
3     -2.619906  2.575246  200.0 -0.075707
4     -3.040726  2.790110  200.0 -0.071156

In [66]:
s = pd.Series(np.random.randn(6))

In [67]:
s

0    1.793546
1   -0.662320
2    0.944394
3   -0.755251
4   -0.439120
5    0.707709
dtype: float64

In [68]:
s[::2] = np.nan

In [69]:
s

0         NaN
1   -0.662320
2         NaN
3   -0.755251
4         NaN
5    0.707709
dtype: float64

In [70]:
s.fillna(s.mean())

0   -0.236620
1   -0.662320
2   -0.236620
3   -0.755251
4   -0.236620
5    0.707709
dtype: float64

In [71]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [72]:
group_key = ['East'] * 4 + ['West'] * 4

In [73]:
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [74]:
data = pd.Series(np.random.randn(8), index=states)

In [75]:
data

Ohio         -0.795551
New York      0.342520
Vermont       0.655086
Florida       1.002924
Oregon        1.319423
Nevada        0.709208
California   -0.259107
Idaho        -0.636829
dtype: float64

In [76]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [77]:
data

Ohio         -0.795551
New York      0.342520
Vermont            NaN
Florida       1.002924
Oregon        1.319423
Nevada             NaN
California   -0.259107
Idaho              NaN
dtype: float64

In [78]:
data.groupby(group_key).mean()

East    0.183297
West    0.530158
dtype: float64

In [79]:
fill_mean = lambda g: g.fillna(g.mean())

In [80]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.795551
New York      0.342520
Vermont       0.183297
Florida       1.002924
Oregon        1.319423
Nevada        0.530158
California   -0.259107
Idaho         0.530158
dtype: float64

In [81]:
fill_values = {'East': 0.5, 'West': -1}

In [82]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [83]:
fill_func

In [84]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.795551
New York      0.342520
Vermont       0.500000
Florida       1.002924
Oregon        1.319423
Nevada       -1.000000
California   -0.259107
Idaho        -1.000000
dtype: float64

In [85]:
suits = ['H', 'S', 'C', 'D']

In [86]:
card_val = (list(range(1, 11)) + [10] * 3) * 4

In [87]:
card_val

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 10,
 10,
 10]

In [88]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [89]:
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [90]:
cards = []

In [91]:
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names) 
deck = pd.Series(card_val, index=cards)

In [92]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [93]:
def draw(deck, n=5):
    return deck.sample(n)

In [94]:
draw(deck)

8S      8
QS     10
AH      1
3C      3
10S    10
dtype: int64

In [95]:
get_suit = lambda card: card[-1]

In [96]:
deck.groupby(get_suit).apply(draw, n=2)

C  KC    10
   2C     2
D  KD    10
   6D     6
H  KH    10
   4H     4
S  QS    10
   5S     5
dtype: int64

In [97]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

4C      4
10C    10
7D      7
4D      4
8H      8
4H      4
KS     10
JS     10
dtype: int64

In [98]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [99]:
df

  category      data   weights
0        a -1.389580  0.266144
1        a -0.772069  0.647232
2        a -1.653928  0.626188
3        a -1.544598  0.526829
4        b  0.026551  0.971479
5        b  1.725630  0.388347
6        b  0.102281  0.599029
7        b  2.061873  0.597349

In [100]:
grouped = df.groupby('category')

In [101]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [102]:
grouped.apply(get_wavg)

category
a   -1.315793
b    0.778054
dtype: float64

In [103]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,index_col=0)

In [104]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [105]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [106]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [107]:
rets = close_px.pct_change().dropna()

In [108]:
get_year = lambda x: x.year

In [109]:
by_year = rets.groupby(get_year)

In [110]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [111]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

In [112]:
import statsmodels.api as sm 
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars] 
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit() 
    return result.params

In [113]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

In [114]:
import pandas as pd

df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
(my_categories=['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], ordered=True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]
result

SyntaxError: invalid syntax (<ipython-input-114-496afd499163>, line 4)

In [ ]:
import pandas as pd
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

In [ ]:
import pandas as pd
pd.Period('01/12/2019', 'M') + 5

In [ ]:
df

In [ ]:
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [ ]:
df = pd.DataFrame([record1, record2, record3],
                  index=['school1', 'school2', 'school1'])

In [ ]:
df

In [ ]:
df.groupby('Jack')